bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32HVB.xml
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Cell Balancing" name="CELL_BALANCING">
            <register-group caption="Cell Balancing" name="CELL_BALANCING">
                <register caption="Cell Balancing Control Register" name="CBCR" offset="0xF1" size="1">
                    <bitfield caption="Cell Balancing Enables" mask="0x0F" name="CBE" lsb="1"/>
                </register>
            </register-group>
        </module>
        <module caption="Battery Protection" name="BATTERY_PROTECTION">
            <register-group caption="Battery Protection" name="BATTERY_PROTECTION">
                <register caption="Battery Protection Parameter Lock Register" name="BPPLR" offset="0xFE" size="1"
                          ocd-rw="R">
                    <bitfield caption="Battery Protection Parameter Lock Enable" mask="0x02" name="BPPLE"/>
                    <bitfield caption="Battery Protection Parameter Lock" mask="0x01" name="BPPL"/>
                </register>
                <register caption="Battery Protection Control Register" name="BPCR" offset="0xFD" size="1">
                    <bitfield caption="External Protection Input Disable" mask="0x20" name="EPID"/>
                    <bitfield caption="Short Circuit Protection Disabled" mask="0x10" name="SCD"/>
                    <bitfield caption="Discharge Over-current Protection Disabled" mask="0x08" name="DOCD"/>
                    <bitfield caption="Charge Over-current Protection Disabled" mask="0x04" name="COCD"/>
                    <bitfield caption="Discharge High-current Protection Disable" mask="0x02" name="DHCD"/>
                    <bitfield caption="Charge High-current Protection Disable" mask="0x01" name="CHCD"/>
                </register>
                <register caption="Battery Protection Short-current Timing Register" name="BPHCTR" offset="0xFC"
                          size="1" mask="0x3F">
                    <bitfield caption="Battery Protection Short-current Timing bits" mask="0x3F" name="HCPT"/>
                </register>
                <register caption="Battery Protection Over-current Timing Register" name="BPOCTR" offset="0xFB" size="1"
                          mask="0x3F">
                    <bitfield caption="Battery Protection Over-current Timing bits" mask="0x3F" name="OCPT"/>
                </register>
                <register caption="Battery Protection Short-current Timing Register" name="BPSCTR" offset="0xFA"
                          size="1" mask="0x7F">
                    <bitfield caption="Battery Protection Short-current Timing bits" mask="0x7F" name="SCPT"/>
                </register>
                <register caption="Battery Protection Charge-High-current Detection Level Register" name="BPCHCD"
                          offset="0xF9" size="1" mask="0xFF">
                    <bitfield caption="Battery Protection Charge-High-current Detection Level bits" mask="0xFF"
                              name="CHCDL"/>
                </register>
                <register caption="Battery Protection Discharge-High-current Detection Level Register" name="BPDHCD"
                          offset="0xF8" size="1" mask="0xFF">
                    <bitfield caption="Battery Protection Discharge-High-current Detection Level bits" mask="0xFF"
                              name="DHCDL"/>
                </register>
                <register caption="Battery Protection Charge-Over-current Detection Level Register" name="BPCOCD"
                          offset="0xF7" size="1" mask="0xFF">
                    <bitfield caption="Battery Protection Charge-Over-current Detection Level bits" mask="0xFF"
                              name="COCDL"/>
                </register>
                <register caption="Battery Protection Discharge-Over-current Detection Level Register" name="BPDOCD"
                          offset="0xF6" size="1" mask="0xFF">
                    <bitfield caption="Battery Protection Discharge-Over-current Detection Level bits" mask="0xFF"
                              name="DOCDL"/>
                </register>
                <register caption="Battery Protection Short-Circuit Detection Level Register" name="BPSCD" offset="0xF5"
                          size="1" mask="0xFF">
                    <bitfield caption="Battery Protection Short-Circuit Detection Level Register bits" mask="0xFF"
                              name="SCDL"/>
                </register>
                <register caption="Battery Protection Interrupt Flag Register" name="BPIFR" offset="0xF3" size="1">
                    <bitfield caption="Short-circuit Protection Activated Interrupt Flag" mask="0x10" name="SCIF"/>
                    <bitfield caption="Discharge Over-current Protection Activated Interrupt Flag" mask="0x08"
                              name="DOCIF"/>
                    <bitfield caption="Charge Over-current Protection Activated Interrupt Flag" mask="0x04"
                              name="COCIF"/>
                    <bitfield caption="Disharge High-current Protection Activated Interrupt" mask="0x02" name="DHCIF"/>
                    <bitfield caption="Charge High-current Protection Activated Interrupt" mask="0x01" name="CHCIF"/>
                </register>
                <register caption="Battery Protection Interrupt Mask Register" name="BPIMSK" offset="0xF2" size="1">
                    <bitfield caption="Short-circuit Protection Activated Interrupt Enable" mask="0x10" name="SCIE"/>
                    <bitfield caption="Discharge Over-current Protection Activated Interrupt Enable" mask="0x08"
                              name="DOCIE"/>
                    <bitfield caption="Charge Over-current Protection Activated Interrupt Enable" mask="0x04"
                              name="COCIE"/>
                    <bitfield caption="Discharger High-current Protection Activated Interrupt" mask="0x02"
                              name="DHCIE"/>
                    <bitfield caption="Charger High-current Protection Activated Interrupt" mask="0x01" name="CHCIE"/>
                </register>
            </register-group>
        </module>
        <module caption="Charger Detect" name="CHARGER_DETECT">
            <register-group caption="Charger Detect" name="CHARGER_DETECT">
                <register caption="Charger Detect Control and Status Register" name="CHGDCSR" offset="0xD4" size="1">
                    <bitfield caption="BATT Pin Voltage Level" mask="0x10" name="BATTPVL"/>
                    <bitfield caption="Charger Detect Interrupt Sense Control" mask="0x0C" name="CHGDISC"/>
                    <bitfield caption="Charger Detect Interrupt Flag" mask="0x02" name="CHGDIF"/>
                    <bitfield caption="Charger Detect Interrupt Enable" mask="0x01" name="CHGDIE"/>
                </register>
            </register-group>
        </module>
