bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32HVB.xml
        <module caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
            <register-group caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
                <register caption="Regulator Operating Condition Register" name="ROCR" offset="0xC8" size="1"
                          ocd-rw="R">
                    <bitfield caption="ROC Status" mask="0x80" name="ROCS"/>
                    <bitfield caption="ROC Disable" mask="0x10" name="ROCD"/>
                    <bitfield caption="ROC Warning Interrupt Flag" mask="0x02" name="ROCWIF"/>
                    <bitfield caption="ROC Warning Interrupt Enable" mask="0x01" name="ROCWIE"/>
                </register>
            </register-group>
        </module>
        <module caption="Bandgap" name="BANDGAP">
            <register-group caption="Bandgap" name="BANDGAP">
                <register caption="Bandgap Control and Status Register" name="BGCSR" offset="0xD2" size="1">
                    <bitfield caption="Bandgap Disable" mask="0x20" name="BGD"/>
                    <bitfield caption="Bandgap Short Circuit Detection Enabled" mask="0x10" name="BGSCDE"/>
                    <bitfield caption="Bandgap Short Circuit Detection Interrupt Flag" mask="0x02" name="BGSCDIF"/>
                    <bitfield caption="Bandgap Short Circuit Detection Interrupt Enable" mask="0x01" name="BGSCDIE"/>
                </register>
                <register caption="Bandgap Calibration of Resistor Ladder" name="BGCRR" offset="0xD1" size="1"
                          mask="0xFF">
                    <bitfield caption="Bandgap Calibration of Resistor Ladder Bits" mask="0xFF" name="BGCR"/>
                </register>
                <register caption="Bandgap Calibration Register" name="BGCCR" offset="0xD0" size="1">
                    <bitfield caption="BG Calibration of PTAT Current Bits" mask="0x3F" name="BGCC"/>
                </register>
            </register-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Clock Output Enable" mask="0x20" name="CKOE"/>
                    <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
                    <bitfield caption="OCD Reset Flag" mask="0x10" name="OCDRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BODRF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Fast Oscillator Calibration Value" name="FOSCCAL" offset="0x66" size="1" mask="0xFF">
                    <bitfield caption="Fast Oscillator Calibration Value" mask="0xFF" name="FCAL"/>
                </register>
                <register caption="Oscillator Sampling Interface Control and Status Register" name="OSICSR"
                          offset="0x37" size="1" ocd-rw="R">
                    <bitfield caption="Oscillator Sampling Interface Select 0" mask="0x10" name="OSISEL0"/>
                    <bitfield caption="Oscillator Sampling Interface Status" mask="0x02" name="OSIST"/>
                    <bitfield caption="Oscillator Sampling Interface Enable" mask="0x01" name="OSIEN"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF">
                    <bitfield caption="General Purpose IO bits" mask="0xFF" name="GPIOR2"/>
                </register>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF">
                    <bitfield caption="General Purpose IO bits" mask="0xFF" name="GPIOR1"/>
                </register>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF">
                    <bitfield caption="General Purpose IO bits" mask="0xFF" name="GPIOR0"/>
                </register>
                <register caption="Digital Input Disable Register" name="DIDR0" offset="0x7E" size="1">
                    <bitfield
                            caption="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled."
                            mask="0x02" name="PA1DID"/>
                    <bitfield
                            caption="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled."
                            mask="0x01" name="PA0DID"/>
                </register>
                <register caption="Power Reduction Register 0" name="PRR0" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x40" name="PRTWI"/>
                    <bitfield caption="Power Reduction Voltage Regulator Monitor" mask="0x20" name="PRVRM"/>
                    <bitfield caption="Power reduction SPI" mask="0x08" name="PRSPI"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x04" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x02" name="PRTIM0"/>
                    <bitfield caption="Power Reduction V-ADC" mask="0x01" name="PRVADC"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x03" name="CLKPS"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC" name="ADC" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Power Off" name="POFF" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Reserved" name="VAL_0x06" value="0x06"/>
                <value caption="Reserved" name="VAL_0x07" value="0x07"/>
            </value-group>

        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0x0F" ocd-rw="R"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0x0F"
                          ocd-rw="R"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x20" size="1" mask="0x0F" ocd-rw="R"/>
            </register-group>
